<template>
  <div class="app-container">
    <h2>宿舍管理须知</h2>
    <ol>
      <li>
        新生入住前到宿舍管理员处领取房门和衣柜钥匙，请在入住期间妥善保管，毕业离校时要如数交回，若有遗失需照价赔偿。
      </li>
      <li>
        入住时检查宿舍各项设施是否完好，若有损坏处及时向宿舍管理员反映以便调换、修缮。入住后请爱护宿舍内各项设施，若人为损坏的需照价赔偿，对恶意损坏宿舍各种设施破坏宿舍环境的将根据情节轻重给予处罚。在住宿期间若有需要维修或更换照明设备时，请到宿舍管理员处登记，由专门人员维修，切勿自己动手。
      </li>
      <li>
        宿舍内不许点蜡烛等明火，严禁使用大功率电器设备。不能存放易燃易爆等危险物品，如有特殊情况要立即向宿舍管理员和学院办公室报告，以便及时处理，防患于未然！
      </li>
      <li>
        自觉保持宿舍卫生，建立值日制度。不要在墙壁上乱写乱画乱钉钉子，保持宿舍墙壁完好。宿舍内严禁乱拉电线和网线，宿舍内有校园网接口，需要使用者开学后到网络中心申请，严禁私自外接网络，一经发现严肃处理。
      </li>
      <li>
        出入宿舍及时锁门确保宿舍安全，宿舍内不允许带闲杂人等入内，如有亲友来访请到宿舍管理员处登记，学生宿舍楼内禁止异性亲友或其他人员进入。
      </li>
      <li>
        宿舍内不准吸烟、酗酒，不能养宠物，不得大声喧哗、吵闹，不得夜不归宿。宿舍大门晚11：30关闭，学生必须在宿舍大门关闭之前返回宿舍，晚归及夜不归宿者将按学院有关规定给予教育处分。
      </li>
      <li>
        学院将对学生宿舍按时检查和不定期抽查，检查时对违规使用大功率电器进行收缴。
      </li>
      <li>
        新生宿舍名单根据具体房间情况随机分配，新生报到后1-2周内后勤部门将根据新生报情况进行调整，届时需要各位同学配合。
      </li>
      <li>
        宿舍内若发现同学发热或多名同学患症状相同病症，应立即向宿舍管理员报告。
      </li>
    </ol>
  </div>
</template>

<script lang="ts" setup></script>

<style scoped lang="scss">
h2 {
  margin: 10px;
  border-bottom: 2px solid black;
}
ol {
  padding: 20px;
  li {
    height: 80px;
    font-size: 20px;
  }
}
</style>
